{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Recharge & SIM",
    "1": "Forfaits mobiles",
    "2": "Services",
    "3": "Urgences",
    "4": "Programme Fid\u00e9lit\u00e9",
    "5": "Offres Internet",
    "6": "Autre"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Autre": 6,
    "Forfaits mobiles": 1,
    "Offres Internet": 5,
    "Programme Fid\u00e9lit\u00e9": 4,
    "Recharge & SIM": 0,
    "Services": 2,
    "Urgences": 3
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.47.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
